{
  "_name_or_path": "nvidia/mit-b0",
  "architectures": [
    "SegformerForSemanticSegmentation"
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "decoder_hidden_size": 256,
  "depths": [
    2,
    2,
    2,
    2
  ],
  "downsampling_rates": [
    1,
    4,
    8,
    16
  ],
  "drop_path_rate": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_sizes": [
    32,
    64,
    160,
    256
  ],
  "id2label": {
    "0": "animal",
    "1": "human.pedestrian.adult",
    "2": "human.pedestrian.child",
    "3": "human.pedestrian.construction_worker",
    "4": "human.pedestrian.personal_mobility",
    "5": "human.pedestrian.police_officer",
    "6": "human.pedestrian.stroller",
    "7": "human.pedestrian.wheelchair",
    "8": "movable_object.barrier",
    "9": "movable_object.debris",
    "10": "movable_object.pushable_pullable",
    "11": "movable_object.trafficcone",
    "12": "static_object.bicycle_rack",
    "13": "vehicle.bicycle",
    "14": "vehicle.bus.bendy",
    "15": "vehicle.bus.rigid",
    "16": "vehicle.car",
    "17": "vehicle.construction",
    "18": "vehicle.emergency.ambulance",
    "20": "vehicle.emergency.police",
    "21": "vehicle.motorcycle",
    "22": "vehicle.trailer",
    "23": "vehicle.truck",
    "24": "vehicle.ego",
    "25": "flat.driveable_surface",
    "255": "ignore"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "animal": 0,
    "flat.driveable_surface": 25,
    "human.pedestrian.adult": 1,
    "human.pedestrian.child": 2,
    "human.pedestrian.construction_worker": 3,
    "human.pedestrian.personal_mobility": 4,
    "human.pedestrian.police_officer": 5,
    "human.pedestrian.stroller": 6,
    "human.pedestrian.wheelchair": 7,
    "ignore": 255,
    "movable_object.barrier": 8,
    "movable_object.debris": 9,
    "movable_object.pushable_pullable": 10,
    "movable_object.trafficcone": 11,
    "static_object.bicycle_rack": 12,
    "vehicle.bicycle": 13,
    "vehicle.bus.bendy": 14,
    "vehicle.bus.rigid": 15,
    "vehicle.car": 16,
    "vehicle.construction": 17,
    "vehicle.ego": 24,
    "vehicle.emergency.ambulance": 18,
    "vehicle.emergency.police": 20,
    "vehicle.motorcycle": 21,
    "vehicle.trailer": 22,
    "vehicle.truck": 23
  },
  "layer_norm_eps": 1e-06,
  "mlp_ratios": [
    4,
    4,
    4,
    4
  ],
  "model_type": "segformer",
  "num_attention_heads": [
    1,
    2,
    5,
    8
  ],
  "num_channels": 3,
  "num_encoder_blocks": 4,
  "patch_sizes": [
    7,
    3,
    3,
    3
  ],
  "reshape_last_stage": true,
  "semantic_loss_ignore_index": 255,
  "sr_ratios": [
    8,
    4,
    2,
    1
  ],
  "strides": [
    4,
    2,
    2,
    2
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.47.0"
}
